# 1. С какой "базы" начинаем. Берем официальный легкий образ Python 3.13
FROM python:3.13-slim

# 2. Указываем рабочую папку внутри контейнера (как cd /app)
WORKDIR /app

# 3. Сначала копируем ТОЛЬКО файл зависимостей
# (Это хитрость Docker: если requirements не менялись, он не будет заново качать библиотеки)
COPY requirements.txt .

# 4. Устанавливаем библиотеки прямо внутри контейнера
RUN pip install --no-cache-dir -r requirements.txt

# 5. Теперь копируем весь остальной код проекта внутрь контейнера
COPY . .

# 6. Говорим Докеру, какой порт будет слушать приложение
EXPOSE 8000

# 7. Команда, которая запустится, когда мы включим контейнер
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]