# Это инструкция для сборки образа

# 1. С какой "базы" начинаем. Берем официальный легкий образ Python 3.13
FROM python:3.13-slim

# Отключаем буферизацию, чтобы логи выводились сразу
ENV PYTHONUNBUFFERED=1

# 2. Указываем рабочую папку внутри контейнера (как cd /app)
WORKDIR /app

# 3. Сначала копируем ТОЛЬКО файл зависимостей
# (Это хитрость Docker: если requirements не менялись, он не будет заново качать библиотеки)
COPY requirements.txt .

# 4. Устанавливаем библиотеки прямо внутри контейнера
RUN pip install --no-cache-dir -r requirements.txt

# 5. Теперь копируем весь остальной код проекта внутрь контейнера
COPY . .
# ГАРАНТИЯ: Удаляем .env внутри контейнера, чтобы настройки брались из docker-compose
RUN rm -f .env

# 6. Говорим Докеру, какой порт будет слушать приложение
EXPOSE 8000

# 7. Команда, которая запустится, когда мы включим контейнер
CMD ["gunicorn", "main:app", "--workers", "1", "--worker-class", "uvicorn.workers.UvicornWorker", "--bind", "0.0.0.0:8000", "--timeout", "120"]